# Задание 6 из ЕГЭ-2025 профиль [https://math-ege.sdamgia.ru/problem?id=283063]
# Найдите корень уравнения (x+8)**5 = 243

import math

num = 243

root = num ** (1/5)

x = root - 8
print('Ответ:', x)
